Microchip-MPLAB-Harmony/motor_control/apps/bldc_bc_hall_pic32_cm_mc/firmware/src/packs/PIC32CM1216MC00048_DFP/component/nvmctrl.h
/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE               _U_(0x00)                                            /**<  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_ADDR_Pos                 _U_(0)                                               /**< (NVMCTRL_ADDR) NVM Address Position */
#define NVMCTRL_ADDR_ADDR_Msk                 (_U_(0x3FFFFF) << NVMCTRL_ADDR_ADDR_Pos)             /**< (NVMCTRL_ADDR) NVM Address Mask */
#define NVMCTRL_ADDR_ADDR(value)              (NVMCTRL_ADDR_ADDR_Msk & ((value) << NVMCTRL_ADDR_ADDR_Pos))
#define NVMCTRL_ADDR_Msk                      _U_(0x003FFFFF)                                      /**< (NVMCTRL_ADDR) Register Mask  */


/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Section -------- */
#define NVMCTRL_LOCK_RESETVALUE               _U_(0x00)                                            /**<  (NVMCTRL_LOCK) Lock Section  Reset Value */

#define NVMCTRL_LOCK_LOCK_Pos                 _U_(0)                                               /**< (NVMCTRL_LOCK) Region Lock Bits Position */
#define NVMCTRL_LOCK_LOCK_Msk                 (_U_(0xFFFF) << NVMCTRL_LOCK_LOCK_Pos)               /**< (NVMCTRL_LOCK) Region Lock Bits Mask */
#define NVMCTRL_LOCK_LOCK(value)              (NVMCTRL_LOCK_LOCK_Msk & ((value) << NVMCTRL_LOCK_LOCK_Pos))
#define NVMCTRL_LOCK_Msk                      _U_(0xFFFF)                                          /**< (NVMCTRL_LOCK) Register Mask  */


/* -------- NVMCTRL_PBLDATA0 : (NVMCTRL Offset: 0x28) ( R/ 32) Page Buffer Load Data 0 -------- */
#define NVMCTRL_PBLDATA0_RESETVALUE           _U_(0xFFFFFFFF)                                      /**<  (NVMCTRL_PBLDATA0) Page Buffer Load Data 0  Reset Value */

#define NVMCTRL_PBLDATA0_PBLDATA_Pos          _U_(0)                                               /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA0_PBLDATA_Msk          (_U_(0xFFFFFFFF) << NVMCTRL_PBLDATA0_PBLDATA_Pos)    /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA0_PBLDATA(value)       (NVMCTRL_PBLDATA0_PBLDATA_Msk & ((value) << NVMCTRL_PBLDATA0_PBLDATA_Pos))
#define NVMCTRL_PBLDATA0_Msk                  _U_(0xFFFFFFFF)                                      /**< (NVMCTRL_PBLDATA0) Register Mask  */


/* -------- NVMCTRL_PBLDATA1 : (NVMCTRL Offset: 0x2C) ( R/ 32) Page Buffer Load Data 1 -------- */
#define NVMCTRL_PBLDATA1_RESETVALUE           _U_(0xFFFFFFFF)                                      /**<  (NVMCTRL_PBLDATA1) Page Buffer Load Data 1  Reset Value */

#define NVMCTRL_PBLDATA1_PBLDATA_Pos          _U_(0)                                               /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data Position */
#define NVMCTRL_PBLDATA1_PBLDATA_Msk          (_U_(0xFFFFFFFF) << NVMCTRL_PBLDATA1_PBLDATA_Pos)    /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data Mask */
#define NVMCTRL_PBLDATA1_PBLDATA(value)       (NVMCTRL_PBLDATA1_PBLDATA_Msk & ((value) << NVMCTRL_PBLDATA1_PBLDATA_Pos))
#define NVMCTRL_PBLDATA1_Msk                  _U_(0xFFFFFFFF)                                      /**< (NVMCTRL_PBLDATA1) Register Mask  */


/** \brief NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLA_REG_OFST         (0x00)              /**< (NVMCTRL_CTRLA) Control A Offset */
#define NVMCTRL_CTRLB_REG_OFST         (0x04)              /**< (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_PARAM_REG_OFST         (0x08)              /**< (NVMCTRL_PARAM) NVM Parameter Offset */
#define NVMCTRL_INTENCLR_REG_OFST      (0x0C)              /**< (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST      (0x10)              /**< (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST       (0x14)              /**< (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_STATUS_REG_OFST        (0x18)              /**< (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST          (0x1C)              /**< (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_LOCK_REG_OFST          (0x20)              /**< (NVMCTRL_LOCK) Lock Section Offset */
#define NVMCTRL_PBLDATA0_REG_OFST      (0x28)              /**< (NVMCTRL_PBLDATA0) Page Buffer Load Data 0 Offset */
#define NVMCTRL_PBLDATA1_REG_OFST      (0x2C)              /**< (NVMCTRL_PBLDATA1) Page Buffer Load Data 1 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief NVMCTRL register API structure */
typedef struct
{  /* Non-Volatile Memory Controller */
  __IO  uint16_t                       NVMCTRL_CTRLA;      /**< Offset: 0x00 (R/W  16) Control A */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       NVMCTRL_CTRLB;      /**< Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       NVMCTRL_PARAM;      /**< Offset: 0x08 (R/W  32) NVM Parameter */
  __IO  uint32_t                       NVMCTRL_INTENCLR;   /**< Offset: 0x0C (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       NVMCTRL_INTENSET;   /**< Offset: 0x10 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       NVMCTRL_INTFLAG;    /**< Offset: 0x14 (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint16_t                       NVMCTRL_STATUS;     /**< Offset: 0x18 (R/W  16) Status */
  __I   uint8_t                        Reserved2[0x02];
  __IO  uint32_t                       NVMCTRL_ADDR;       /**< Offset: 0x1C (R/W  32) Address */
  __IO  uint16_t                       NVMCTRL_LOCK;       /**< Offset: 0x20 (R/W  16) Lock Section */
  __I   uint8_t                        Reserved3[0x06];
  __I   uint32_t                       NVMCTRL_PBLDATA0;   /**< Offset: 0x28 (R/   32) Page Buffer Load Data 0 */
  __I   uint32_t                       NVMCTRL_PBLDATA1;   /**< Offset: 0x2C (R/   32) Page Buffer Load Data 1 */
} nvmctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMMC00_NVMCTRL_COMPONENT_H_ */
